Revit 2027 API
BuiltInFailures.CuttingFailures Class
 Failures about Cutting.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.CuttingFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class CuttingFailures
Public NotInheritable Class CuttingFailures
public ref class CuttingFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type CuttingFailures = class end
The BuiltInFailures.CuttingFailures type exposes the following members.
Properties
Name | Description
CannotCopyFromMultipleLinks |  Elements cannot be copied from multiple links at the same time.
ElementsWithNotCopiedParentsDeleted |  Some elements were deleted because elements that they require for references were not copied.
NoFileSaved |  No file has been saved.
NoSupported2DElementsToCopyFromView |  None of the elements in the view you have selected are supported for the insert 2D operation.
UnableToCopyElementsFromFile |  Unable to copy elements from file.
UnableToPasteToFile |  Unable to paste current clipboard contents to file.
UnableToReplaceWithLink |  Selected elements were copied to new file but Revit was unable to replace them with link to that file.
Top
See Also
Reference
Autodesk.Revit.DB Namespace